Repository: hlbn/Motify
Catalog: Kits/UtilityKit/Sources/Resources/Localizable.xcstrings
Source language: en
Languages: sk

# common.button.cancel
source: Cancel
sk: Zrušiť

# email.error
source: Incorrect e-mail format
sk: Nesprávny formát email adresy

# exercise.add.nav.title
source: Add Exercise
sk: Pridať cvičenie

# exercise.description
source: Description
sk: Popis

# exercise.description.hint
source: Describe your exercise
sk: Popíš svoje cvičenie

# exercise.duration
source: Duration
sk: Dĺžka trvania

# exercise.edit.nav.title
source: Edit Exercise
sk: Upraviť cvičenie

# exercise.error.descriptionrequired
source: Description required
sk: Popis je povinný

# exercise.error.titlerequired
source: Exercise type required
sk: Typ cviku je povinný

# exercise.error.zerolength
source: Duration cannot be 0
sk: Dĺžka trvania nemôže byť 0

# exercise.filter.all
source: All
sk: Všetko

# exercise.filter.local
source: Local
sk: Lokálne

# exercise.list.nav.title
source: Exercises
sk: Cvičenia

# exercise.location
source: Location
sk: Lokácia

# exercise.location.empty
source: Empty
sk: Prázdne

# exercise.location.select
source: Select
sk: Vybrať

# exercise.none
source: None
sk: Žiadne

# exercise.run
source: Running
sk: Beh

# exercise.save
source: Save
sk: Uložiť

# exercise.save.alert.title
source: Validation failed
sk: Validácia zlyhala

# exercise.save.error
source: Form contains errors.
sk: Formulár obsahuje chyby

# exercise.save.on.cloud
source: Save on Cloud
sk: Uložiť na Cloud

# exercise.save.server.error
source: Could not save workout
sk: Nepodarilo sa uložiť cvičenie

# exercise.save.server.error.message
source: Please try it later
sk: Skúste to prosím neskôr

# exercise.walk
source: Walking
sk: Chôdza

# exercise.weightlift
source: Weightlifting
sk: Posilňovanie

source: Log in
sk: Prihlásiť sa

# login.auth.error
source: Couldn’t log in
sk: Prihlásenie sa nepodarilo

# login.subtitle
source: Start tracking your achievements
sk: Začni si zaznamenávať svoje výkony

# login.title
source: Welcome
sk: Vitajte

# logout.error
source: Failed to logout
sk: Nepodarilo sa odhlásiť

source: minutes
sk: minút

source: Password
sk: Heslo

# password.error.lenght
source: Minimum 6 characters
sk: Minimálne 6 znakov

# password.notmatching
source: Passwords do not match
sk: Heslá sa nezhodujú

# profile.email
source: User e-mail
sk: Uživateľský e-mail

# profile.favorite.exercise
source: Favorite exercise
sk: Obľúbený cvik

# profile.logout
source: Logout
sk: Odhlásiť sa

# profile.total.hours
source: Total hours of exercise
sk: Hodiny cvičenia celkom

# profile.total.trainings
source: Total trainings
sk: Počet tréningov celkom

source: Register
sk: Registrovať sa

# register.auth.error
source: Couldn’t register
sk: Registrácia sa nezdarila

# register.screen.title
source: Registration
sk: Registrácia

# register.subtitle
source: Register to track your achievements
sk: Zaregistruj sa a zaznamenávaj svoje úspechy

# register.successful.message
source: Now you can login using your account
sk: Teraz sa môžete prihlásiť pomocou svojhu účtu

# register.successful.title
source: Registration successful
sk: Registrácia úspešná

# register.title
source: Let’s begin
sk: Začíname

source: Repeat password
sk: Zopakujte heslo

# tab.dashboard
source: Exercises
sk: Cvičenia

# tab.profile
source: Profile
sk: Profil

source: Unknown
sk: Neznáme
